app/controllers/patterns_controller.rb

  def create
	 	@pattern = Pattern.new(pattern_params)

	 		if @pattern.save
---
INSERT INTO "patterns" ("created_at", "description", "gauge", "needles", "title", "updated_at", "yarn") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def index
  	@pattern = Pattern.all
---
SELECT "patterns".* FROM "patterns"

  def show
  	@pattern = Pattern.find(params[:id])
---
SELECT "patterns".* FROM "patterns" WHERE "patterns"."id" = $1 LIMIT 1  [["id", "5"]]